# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Sat Apr 25 12:23:38 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design row_sequencer

create_clock -name "clk" -period 20.0 -waveform {0.0 10.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports tdi_enable]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {TX[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {RST[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {SEL[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports frame_done]
set_wire_load_mode "enclosed"
set_dont_use true [get_lib_cells tsl18fs120_scl_ss/slbhb2]
set_dont_use true [get_lib_cells tsl18fs120_scl_ss/slbhb1]
set_dont_use true [get_lib_cells tsl18fs120_scl_ss/slbhb4]
